Revit 2024 API
RevisionCloud.RevisionId Property
 The Revision associated with this RevisionCloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId RevisionId { get; set; }
Visual Basic
Public Property RevisionId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ RevisionId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 This property cannot be set to a Revision that has already been issued. If this RevisionCloud is already associated with a Revision that has been issued then this property cannot be changed.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: revisionId is not a valid Revision. -or- When setting this property: This operation cannot be performed because revisionId is an issued Revision.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This operation cannot be performed on a RevisionCloud associated with a Revision that has been issued.
See Also
RevisionCloud Class
Autodesk.Revit.DB Namespace